#რა განსხვავებაა ბრჭყალებში ჩაწერილ რიცხვსა და ჩვეულებრივ integer რიცხვს შორის
#ბრჭყალებში ჩაწერილი რიცხვს პროგრამა აღიქვამს როგორც ტექსტს,string-ს,და print ის საშუალებით შეგვიძლია ის ბრჭყალებითაც და ბრჭყალების გარეშე ტერმინალზე გამოვიტანოთ
#მაგრამ მათ შორის მთავარი განსხვავება ისაა რომ ბრჭყალებში ჩაწერილ რიცხვზე ვერ განვახორციელებთ მათემატიკურ ოპერაციებს,integer ისგან განსხვავებით
#მაგალითად
print("18" + "10") #რიცხვები კიარ შეიკრიბება, არამედ როგორც ტექსტი ერთმანეთს დაემატება
print(18 + 10)   #რიცხვები ჩვეულებრივ შეიკრიბა ვინაიდან ის ჩავწერეთ integer-ის სახით,ანუ ბრჭყალების გარეშე




num1 = 10
num2 = 2

Addition = num1 + num2    #addition ინგლისურად ნიშნავს შეკრებას/დამატებას
Substraction = num1 - num2  #Substraction ინგლისურად ნიშნავს გამოკლებას
multiplication = num1 * num2 #Multiplication ინგლისურად ნიშნავს გამრავლებას
Division = num1 / num2 #Division/divide ინგლისურად ნიშნავს გაყოფას
print(Division)



a = 57
b = 4
print(a + b)
print(a - b)
print(a * b)
print(a / b)
print(a // b)
print(a % b)
print(a ** b)




x = 10
x = x + 5
x = x * 2
print(x)  #ტერმინალზე გამოვიდა რიცხვი 30,ეხლა ეს როგორ მოხდა და რატომ არ გამოვიდა 10?.
#პირველ ხაზზე x ის მნიშვნელობაა 10,მეორე ხაზზე მას overwrite  გავუკეთეთ და მისი მნიშვნელობა გახდა 15,და მესამე ხაზზე ის 2ზე გავამრავლეთ
#შესაბამისად ტერმინალზე გამოვიდა 30 და არა 10 ვინაიდან პროგრამა ზემოდან ქვემოთ მოყვება.


balance = 100
balance = balance - 30
balance = balance + 50
balance = balance * 2
print(balance)


print("Group 96 is the best" * 96)