#არსებობს რამოდენიმე სახის მათემატიკური ოპერატორი,ესენია
print(2 + 2)   # + მიმატება
print(4 - 2)   # - გამოკლება
print(15 / 3)  # / გაყოფა(ყოველთვის ვიღებთ float ტიპის მნივნელობას ანუ არამთელს)
print(3 * 5)    # * გამრავლება
print(15 // 2)   # // რითაც ტერმინალზე გამოგვაქვს იმის მაქსიმალური რაოდენობა თუ რამდენჯერ ჩაეტევა პირველ რიცხვში მეორე
print(15 % 2)   # % ტერმინალზე გამოგვაქვს თუ რა ნაშთი დაგვრჩება ერთი რიცხვის მეორეზე გაყოფისას


#კონკატინაცია არის სტრინგების შეერთება მაგ. 
print("hello" + "world")

num1 = 15
num2 = 10
print(num1 + num2)

name = "dito"
age = 15
height = 1.75
print(f"hello my name is {name},my age is {age},my height is {height}")