print("python-პროგრამირების ენაა რომელიც ნიდერლანდელმა პროგრამისტმა-Guido van rossum მა 1991წელს გამოუშვა")  # print() არის ფუნქცია, რომლის საშუალებითაც
# პროგრამიდან ინფორმაცია ეკრანზე (ტერმინალზე) გამოგვაქვს.
# ამ ფუნქციით შეგვიძლია ეკრანზე გამოვიტანოთ:
# - ტექსტი
# - რიცხვები
# - ცვლადების მნიშვნელობები
# - გამოთვლების შედეგები

print("python დღეს მსოფლიოში ერთ-ერთი ყველაზე მოთხოვნადი ენაა რადგან:")
print("1-მას მარტივი სინტაქსი აქვს")
print("2-იდეალურია დამწყებთათვის")
print("3-ძალიან ძლიერი და მოქნილია პროფესიონალებისთვისაც")
print("პითონი თითქმის ყველგან გვხვდება და მას ისეთი დიდი კომპანიები იყენებენ როგორიცაა-Google,Youtube,Meta,Netflix, etc.")
print("პითონი ეყრდნობა პრინციპებს,რომელიც ცნობილია როგორც-the zen of python")
print("1-სუფთა კოდი სჯობს რთულს")
print("2-მკაფიო სჯობს ბუნდოვანს")
print("3-მარტივი სჯობს ჩახლართულს")
print("ეს სწორედ ის პრინციპებია რის გამოც პითონი ასე მარტივად ისწავლება")
print("დასკვნა:Python არის თანამედროვე, ძლიერი და უნივერსალური პროგრამირების ენა, რომელიც გამოიყენება როგორც სწავლისთვის, ისე პროფესიონალური პროექტებისთვის. მისი სიმარტივე და შესაძლებლობები მას ერთ-ერთ ყველაზე პოპულარულ ენად აქცევს მსოფლიოში.")




my_age = 15    #integer ტიპის ცვლადი,გამოვიყენეთ მთელ რიცხვიანი მნიშვნელობა.
friends_age = 17
print(my_age)
print(friends_age)


word1 = "პითონი"
word2 = "ძალიან"
word3 = "საინტერესოა"
print(word1 + " " + word2 + " " + word3)