for i in range(50, 201):  #50დან 200მდე რიცხვების გამოტანა
    print(i)

for i in range(2, 101, 2): #ყველა ლუწი რიცხვი 1დან 100მდე
    print(i)

for i in range(101, 151, 2):  #ყველა კენტი რიცხვი 100დან 150მდე
    print(i)



i = 1

while i <= 50:   #1დან 50მდე რიცხვების გამოტანა
    print(i)
    i += 1

i = 20

while i <= 60:  #20დან 60მდე რიცხვები 5ის გამოტოვებით

    print(i)
    i += 5


surname = input("Enter your surname: ")  #მომხმარებლის გვარის თითოეული ასოს ცალკე გამოტანა

for letter in surname:
    print(letter)


#წვენის გაყიდვის პროგრამა
stock = 300

while stock > 0:
    print("You have bought the drink")
    stock -= 2
    print("Drinks left:", stock)

print("Out of stock")



for i in range(50, 19, -3):  #50დან 200მდე რიცხვები 3ის გამოკლებით
    print(i)


i = 150

while i >= 0:  #150დან 0ამდე 
    print(i)
    i -= 1


#რაარის for loop,for loop არის ციკლი რომელიც გვეხმარება ერთი და იგივე მოქმედება რამდენჯერმე გავიმეოროთ მარტივად




#While loop
#while loop მუშაობს იმ შემთხვევაში თუ მისი პირობა არის True ანუ ჭეშმარიტი. მაგალითად
i = 1  #იქმნება ცვლადი i = 1

while i <= 5:  #პროგრამა ამოწმებს პირობას,თუ პირობა შესრულდა და არის true მაშინ while loop იმუშავებს

    print(i)
    i += 1


    #რატომ სჭირდება while loops  counter ცვლადი?counter ცვლადი საჭიროა იმისთვის რომ ვიცოდეთ თუ რამდენჯერ შესრულდა ციკლი და როდის უნდა გაჩერდეს
    #მაგალითზე განვიხილოთ თუ რატომ გვჭირდება counter ცვლადი
    #პირველი მაგალითი counter ცვლადის გარეშე 
    i = 1

while i <= 5:
    print(i)  #i არ იცვლება და პროგრამა უსასრულოდ დაბეჭდავს 1-ს

#ამიტომ i ცვლადს ასე შევცვლით i += 1 რათა საბოლოო პირობა გახდეს false და ციკლი დასრულდეს