#კოდის წერას როგორც ყველაფერს აქვს თავისი ეთიკა,რომელიც უნდა ვეცადოთ რომ დავიცვათ.არსებობს პითონში ე.წ ცუდი პრაქტიკები რომელიც შეიძლება ტექნიკურად გამართული იყოს მაგრამ პითონის ეთიკაში არ ჯდება
#ცვლადების შექმნის დროს ცუდი პრაქტიკის მაგალითებია:
#1-ცვლადისთვის შეუსაბამო სახელების გამოყენება,ან საერთოდ სახელების არ გამოყენება.მაგ-
boy = "dito"
a = "dito"
#როდესაც შეგვიძლია ესე გავაკეთოთ
name = "dito"


#2-ცვლადების უაზროდ გამოყენება,როდესაც არაა საჭირო.მაგ
x = 100
print(x)


#3-რამოდენიმე ცვლადის ერთ ხაზზე განლაგება მაგ.
a = 10; b = 15; c= 20; 


#Debugging
#Debugging არის "bug" ების,ანუ ტექნიკური პრობლემების შემოწმება და გასწორება როდესაც კოდის წერას მოვრჩებით,ან პროცესში რაც კოდის წერის უმნიშვნელოვანესი ნაწილია,ერთმა bug ი გააფუჭებს მთელ კოდს ამიტომ საჭიროა მისი პოვნა და გასწორება


#კოდების გასწორება
name = "Lika" 
print(name)  #საჭიროა ცვლადის სახელი სრული სიზუსტით გადავიტანოთ


number = 5
text = "Apples"
result = str(number) + text
print(result)


name = "lika"
name2 = name + "4"
print(name2)


first_user = "lika"
second_user = "giorgi"
print(first_user)


first_name = "dato"
last_name = "papiashvili"



city = input("enter your city:")
district = input("enter your district:")



age = input("enter your age:")
print(f"you are {age} years old")



Num1 = input("enter your age:")
Num2 = input("enter your fathers age:")

result = Num1 + Num2
print(result)  #ტერმინალზე გამოვიდა 1540 და არა 55 რადგან input ყოველთვის ინახავს string ტიპის მნიშვნელობას მიუხედავად იმისა ჩვენ იქ ინტეჯერს ჩავწერთ თუ არა,შესაბამისად მათემატიკური ოპერაცია ვერ განხორციელდა,ისინი უბრალოდ გვერდიგვერდ დაემატა ერთმანეთს

